In [ ]:
import numpy as np
import pandas as pd

In [ ]:
dataset = pd.read_csv("Churn_Modelling.csv", index_col = 'RowNumber')
dataset.head()

           CustomerId   Surname  ...  EstimatedSalary Exited
RowNumber                        ...
1            15634602  Hargrave  ...        101348.88      1
2            15647311      Hill  ...        112542.58      0
3            15619304      Onio  ...        113931.57      1
4            15701354      Boni  ...         93826.63      0
5            15737888  Mitchell  ...         79084.10      0

[5 rows x 13 columns]

In [ ]:
dataset.shape

(10000, 13)

In [ ]:
dataset.describe()

         CustomerId   CreditScore  ...  EstimatedSalary        Exited
count  1.000000e+04  10000.000000  ...     10000.000000  10000.000000
mean   1.569094e+07    650.528800  ...    100090.239881      0.203700
std    7.193619e+04     96.653299  ...     57510.492818      0.402769
min    1.556570e+07    350.000000  ...        11.580000      0.000000
25%    1.562853e+07    584.000000  ...     51002.110000      0.000000
50%    1.569074e+07    652.000000  ...    100193.915000      0.000000
75%    1.575323e+07    718.000000  ...    149388.247500      0.000000
max    1.581569e+07    850.000000  ...    199992.480000      1.000000

[8 rows x 10 columns]

In [ ]:
X = dataset.iloc[:, :-1]
y = dataset.iloc[:, -1]

In [ ]:
from sklearn.model_selection import train_test_split
X_rem, X_analytics, y_rem, y_analytics = train_test_split(X, y, test_size = 0.25, random_state = 0)

In [ ]:
dataset_analytics = pd.concat([X_analytics, y_analytics], axis = 1)
dataset_remaining = pd.concat([X_rem, y_rem], axis = 1)
dataset_analytics.shape

(2500, 13)

In [ ]:
dataset_analytics.to_csv('Churn_analytics.csv')
dataset_remaining.to_csv('Churn_75remaining.csv')